{ "translation": { "zh": "好吧，我需要问你这个——你有没有服用任何精神兴奋或麻醉药物？",  "en": "Okay, I need to ask you this — do you take any recreational drugs at all?" } }
{ "translation": { "zh": "我上个礼拜开车时，撞到另外部车，从那时候，我一直都有想吐的感觉。",  "en": "I hit another car while driving last week, and I've been feeling nauseous since then." } }
{ "translation": { "zh": "我認為我有咖啡因階段證 如果沒喝咖啡 我一整天都會無法自製的發抖",  "en": "I think I have a caffeine withdrawal disorder and if I don't drink coffee I'll be shaking uncontrollably throughout the day" } }
{ "translation": { "zh": "用你自己的话告诉我今天是什么让你进来了。",  "en": "Just in your own words, tell me what's brought you in today." } }
{ "translation": { "zh": "所以你妹妹也是，我要给你做检查。",  "en": "So your sister as well, I'm going to examine you." } }
{ "translation": { "zh": "您的腿部或肺部有过血栓史吗？近六个月内是否有过患癌史？您是否使用任何口服避孕药或激素替代疗法？你的腿是否比另一条腿肿胀？你咳过血吗？",  "en": "Have you ever had a history of having a clot in your leg or in your lungs? Have you ever had a history of having cancer in the recent six months? Do you use any oral contraceptives or hormone replacement therapy? Are any of your legs more swollen than the other? Have you ever coughed up blood?" } }
{ "translation": { "zh": "我洗澡的时候发现我的背，下半身发现有一个肿块但是不疼。",  "en": "I was in the shower and found a lump in my lower back but it didn't hurt." } }
{ "translation": { "zh": "你在服用任何药物吗？",  "en": "Are you taking any medications for it?" } }
{ "translation": { "zh": "只是想继续问你一些关于你今天的健康状况。",  "en": "Just want to move on to asking you a bit about how your health has been leading up to today." } }
{ "translation": { "zh": "牙齿不疼偏咀嚼也会出现这种情况吗",  "en": "When the teeth don't hurt, does this happen for chewing-side preference?" } }
{ "translation": { "zh": "左脚脚底跟痛，特别是早晨起来，下床时候痛得站不起来",  "en": "Pain in the heel of the left foot, especially in the morning, when getting out of bed, the pain is so painful that I cannot stand" } }
{ "translation": { "zh": "在早上的时候常常会头晕，呼吸会不顺。",  "en": "In the morning, I often feel dizzy and have trouble breathing." } }
{ "translation": { "zh": "我昨天去跟朋友吃饭的时候，进去时有一个人打嚏喷，喷到我的脸。现在我吃食物的时候什么味道都没，你觉得有没有可能是COVID吗？",  "en": "When I went to have dinner with friends yesterday, a person sneezed on my face. Now when I eat food there is no taste at all, do you think it could be COVID?" } }
{ "translation": { "zh": "被热油烫了手，立即用冰水冲了，但是皮破了",  "en": "I scalded my hand with hot oil and immediately washed it with ice water, but the skin was broken" } }
{ "translation": { "zh": "我最近三个月的经期都不正常。",  "en": "I have had irregular periods for the last three months." } }
{ "translation": { "zh": "这几天我的耳朵有点怪怪的声音一直在我的身边。而且这个声音一直都没有停下来。我觉得怪怪的。",  "en": "These days my ears have a bit of a weird sound that has been around me. And the voice never stopped. I feel weird." } }
{ "translation": { "zh": "手脚最近常常冰冷，感觉血液循环不良，要怎么改善呢？",  "en": "My hands and feet are often cold recently, and I feel poor blood circulation. How can I improve it?" } }
{ "translation": { "zh": "过去三天你一直咳嗽和喉咙痛；有点，没有什么能让它真正变得更好，或者你服用了扑热息痛，这有点帮助。",  "en": "You’ve had this cough and sore throat for the last three days; it’s sort of, nothing makes it really better, or you have taken paracetamol, that’s helped a little bit." } }
{ "translation": { "zh": "你有没有头部受伤？",  "en": "Have you ever had any head injuries?" } }
{ "translation": { "zh": "在日常生活中，如何早期发现髋关节发育不良，能及时就医。",  "en": "In daily life, how to detect hip dysplasia early and seek medical treatment in time." } }
{ "translation": { "zh": "在外面吹到冷風的時候 我就會頭痛",  "en": "I get a headache when I get blown by cold wind outside" } }
{ "translation": { "zh": "那么，我们现在需要做的是检查一些生命体征，我需要检查你，然后我们才能决定，你知道，你的喉咙痛和咳嗽是怎么回事，然后从那里开始。你可以吗？",  "en": "Well, what we need to do now is to check some vital signs, and I need to examine you before we could decide, you know, what’s going on with your sore throat and cough, and take it from there. Is that okay with you?" } }
{ "translation": { "zh": "当时晕了不到一分钟应该就醒来了. 然后头痛也是在慢慢好 但是我想快点好",  "en": "At that time, I should have woken up after fainting for less than a minute. Then the headache was gradually getting better, but I wanted to get better soon." } }
{ "translation": { "zh": "你有没有鼻塞，或者——鼻窦问题？",  "en": "Do you ever suffer with nasal congestion, or — sinus problems?" } }
{ "translation": { "zh": "那你去厕所后疼痛会消失吗？",  "en": "Then does that pain go away once you've been to the toilet?" } }
{ "translation": { "zh": "好的，大约一周前也是如此。你有没有采取任何措施来帮助退烧？它有帮助吗？",  "en": "Okay, so about a week ago as well. Have you taken anything to try to help with the fever? Did it help at all?" } }
{ "translation": { "zh": "我的左手臂突然的抽动。抽动了大约1，3分钟自己停止了。这个迹象有点奇怪。",  "en": "My left arm jerked suddenly. Twitched for about 1 to 3 minutes and stopped by itself. This sign is a bit odd." } }
{ "translation": { "zh": "我今天喉咙有点不舒服，可能是因为昨天吃太多炸物了。",  "en": "I have a bit of a sore throat today, probably because I ate too much fried food yesterday." } }
{ "translation": { "zh": "林医生，我腿被车撞了，现在很疼，在右侧这里。",  "en": "Dr. Lin, my leg was hit by a car, and now it hurts, here at the right side." } }
{ "translation": { "zh": "我只想问关于整个肠道本身的其余问题。",  "en": "I'm just going to ask the rest of the questions just about the whole gut itself." } }
{ "translation": { "zh": "天哪，好吧……而且，咳嗽和喉咙痛——白天或晚上的任何特定时间是否更糟？",  "en": "Gosh, okay.. And, the cough and sore throat - is it worse any particular time of the day or night?" } }
{ "translation": { "zh": "常常我睡觉的时候，我都会觉得有人在看我。",  "en": "Often when I'm sleeping, I feel like someone is watching me." } }
{ "translation": { "zh": "所以我只是想稍微了解一下您遇到的问题。这样可以吗？",  "en": "So I'm just going to find out a little bit about the problem that you've come in with. Would that be alright?" } }
{ "translation": { "zh": "我昨天在煮泡麵的時候不小心把熱水打翻 然後熱水都溅到我手上 好像有點燙傷了",  "en": "When I was cooking instant noodles yesterday, I accidentally overturned the hot water and all the hot water splashed on my hands, which seemed a little burnt" } }
{ "translation": { "zh": "每當我流血的時候都會花超過五分鐘才有辦法止血",  "en": "Whenever I bleed it takes more than five minutes to stop the bleeding" } }
{ "translation": { "zh": "好的，你的脑电图显示你有癫痫症。这是在您的药物增加之前的 5 月完成的，我们必须讨论让您进行另一项检查。你头部的核磁共振检查结果正常，你所有的实验室都很好。不要错过剂量是非常重要的。",  "en": "Okay, your electroencephalogram shows that you have seizure disorder. This was done on May before your medication increased and we have to talk about getting you another test. The MRI of your head was normal and all of your labs are fine. It's very important that you do not miss a dose." } }
{ "translation": { "zh": "嗯，你的口味怎么样 - 口味有什么变化吗？你有口腔溃疡吗？",  "en": "Um, what about your tastes - any changes in tastes? Do you get mouth ulcers at all?" } }
{ "translation": { "zh": "如果你不介意我问，你通常晚上睡几个枕头？",  "en": "And if you don’t mind me asking, how many pillows do you normally sleep with at night?" } }
{ "translation": { "zh": "呼吸有问题吗？",  "en": "Any problems with breathing?" } }
{ "translation": { "zh": "在你感觉到某种呼吸之前，你能走多远？",  "en": "How far can you walk before you feel a sort of breath?" } }
{ "translation": { "zh": "我的大腿到我的小腿之间有剧烈的疼痛感尤其是走路有疼痛感。没有吃任何的止痛药，疼痛差不多有30分钟。",  "en": "I have severe pain from my thigh to my calf especially when walking. I didn't take any painkillers, and the pain lasted for almost 30 minutes." } }
{ "translation": { "zh": "我可以先问一下你的名字和年龄吗？",  "en": "Can I start by just getting your name and your age please?" } }
{ "translation": { "zh": "你会如何描述疼痛？你说它是——呃，在你的胸部中间，稍微在左侧——那么，它会去任何地方，比如你的左臂，或者你的下巴，还是只是停留在那里？",  "en": "And how would you describe the pain? And you said it’s — it’s uh, in the middle of your chest, slightly on the left side — so, does it go anywhere, like to your left arm, or to your jaw, or does it just stay there?" } }
{ "translation": { "zh": "最近没有食欲，吃点东西胃就胀气，腹部也不舒服",  "en": "I have no appetite recently, my stomach is flatulent when I eat something, and my abdomen is uncomfortable" } }
{ "translation": { "zh": "你最近有什么病吗？你最近有没有去任何地方旅行？",  "en": "Have you had any recent illnesses? Have you traveled anywhere recently?" } }
{ "translation": { "zh": "所以只想问你一些关于身体其他系统的问题。",  "en": "So just want to ask you some questions about the other systems of the body." } }
{ "translation": { "zh": "最近三个月我都完全没有动力，我都只想在床上待着。",  "en": "I've had absolutely no motivation for the last three months and I just want to be in bed." } }
{ "translation": { "zh": "突然咳嗽咳出了血痰，干咳了有很长一段时间，感觉有点累",  "en": "Suddenly coughed up bloody sputum, dry cough for a long time, feeling a little tired" } }
{ "translation": { "zh": "我可以查一下你的名字和出生日期吗？今天是什么让你进来的？对对对你能告诉我更多吗？",  "en": "Can I check your name and date of birth? And what’s brought you in today? Right, okay. Can you tell me a bit more about it?" } }
{ "translation": { "zh": "最近我看到食物就非常想吐，看到食物都觉得恶心，有时候根本都不会想看到食物。",  "en": "Lately I've been so nauseous when I see food, I feel sick when I see food, and sometimes I don't want to see food at all." } }
{ "translation": { "zh": "我昨天煮饭的时候，烫到手，现在什么都拿不起来。",  "en": "When I was cooking yesterday, my hands were scalded, and now I can't lift anything." } }
{ "translation": { "zh": "一日两次，每次两粒。你有没有错过一剂？",  "en": "Two pills two times a day. Have you ever missed a dose?" } }
{ "translation": { "zh": "已经有两个多月没有咳嗽症状了，而且一直没出现过气喘和憋气现象啊",  "en": "It has been more than two months without cough symptoms, and there has been no wheezing or suffocation." } }
{ "translation": { "zh": "你在服用其他药物吗？",  "en": "Are you taking any other medication?" } }
{ "translation": { "zh": "你有没有注意到出汗，尤其是在晚上？你发烧了吗？感觉很温暖，好吧。你什么时候第一次注意到这一点的？",  "en": "Have you noticed any sweating, particularly at night? Have you had a fever at all? Felt quite warm, okay. And when did you first notice that?" } }
{ "translation": { "zh": "昨天下班之后觉得嗓子干，口渴，微咳，就是全身不舒服。我觉得会有新冠的症状但是我没有测就觉得不舒服。",  "en": "After get off work yesterday, I felt my throat was dry, I was thirsty, I had a slight cough, and my whole body was not feeling well. I think there will be symptoms of the COVID, but I don't feel well without testing." } }
{ "translation": { "zh": "我只是总结一下你刚才告诉我的内容。如果我弄错了，请告诉我。",  "en": "I’m just gonna summarize back what you’ve just told me. If I get any of it wrong, just let me know." } }
{ "translation": { "zh": "从三个月前，我每天都没什么胃口，连水都不想喝。",  "en": "Since three months ago, I have lost my appetite every day, and I don't even want to drink water." } }
{ "translation": { "zh": "那再耽误下去里面那颗牙就会不会一直长再那个位置，不往前面长啊",  "en": "Then if it is delayed, will the tooth in the inside grow in that position forever, instead of growing in the front?" } }
{ "translation": { "zh": "最近几天我都不敢出去，因为觉得有人在看我，会有人跟踪我。",  "en": "In the past few days, I dare not go out because I feel that someone is watching me and someone will follow me." } }
{ "translation": { "zh": "那我现在该吃什么 吃多久没见好再去医院呢",  "en": "So what should I eat now? How long should I continue to see if there's improvement before going to the hospital?" } }
{ "translation": { "zh": "我在上厕所的时候，膀胱都有点痛。",  "en": "My bladder hurts a bit when I go to the bathroom." } }
{ "translation": { "zh": "进来走路的时候觉得胸口这里会感到不舒服，而且比较容易喘气，不知道什么原因。",  "en": "When I walked in, I felt uncomfortable in my chest, and I easily got out of breath. I don't know the reason." } }
{ "translation": { "zh": "咳嗽有效果吗？如果有，痰是什么颜色的？",  "en": "Is the cough productive? And if so, what color is the sputum?" } }
{ "translation": { "zh": "我应该挫裂伤不严重吧 也没有呕吐 就只头痛",  "en": "I don't think the contusion was serious, and I didn't vomit, just a headache." } }
{ "translation": { "zh": "在第四天的时候喉咙还是疼痛感而且一直咳嗽。我有喝很多水但是咳嗽一直没有下去。",  "en": "On the fourth day, my throat was still sore and I kept coughing. I drank a lot of water but the cough didn't go away." } }
{ "translation": { "zh": "每次我洗头的时候我都发现我头发掉很多。",  "en": "Every time I wash my hair, I find that I lose a lot of hair." } }
{ "translation": { "zh": "那你的视力呢，你戴眼镜吗？好吧，视力好吗？",  "en": "And what about your vision, do you wear glasses? Okay, vision’s good?" } }
{ "translation": { "zh": "你有没有觉得你的心脏有额外的跳动？",  "en": "Do you ever feel your heart having extra beat?" } }
{ "translation": { "zh": "这是在剂量增加之前还是之后？",  "en": "Was this before or after the dose increase?" } }
{ "translation": { "zh": "我喉嚨痛快三個禮拜了 通常會持續那麼久嗎",  "en": "I've had a sore throat for almost three weeks does it usually last that long?" } }
{ "translation": { "zh": "我右手手腕在施力的时候会有点刺痛。",  "en": "My right wrist tingles a little when I apply force." } }
{ "translation": { "zh": "间接段的时候我坐下然后站起有觉得头晕，视力模糊。但是坐一会就好了。",  "en": "During the indirect segment I sat down and when I stood up I felt dizzy and my vision was blurry. But it got better after I sat for a while." } }
{ "translation": { "zh": "连续几天心脏不舒服，胸闷，有时感觉呼吸都困难。",  "en": "Heart discomfort, chest tightness, and sometimes difficulty breathing for several days in a row." } }
{ "translation": { "zh": "有糖尿病和高血壓",  "en": "have diabetes and high blood pressure" } }
{ "translation": { "zh": "所以根据你告诉我的情况，听起来这可能是由你的心脏问题引起的。考虑到这一点，我想拍一张你的心脏照片，称为超声心动图来测试一下。",  "en": "So based on what you've told me, it sounds like this could be caused by a problem with your heart. And given that, I'd like to get a picture of your heart called an echocardiogram to test this out." } }
{ "translation": { "zh": "有时候有点头晕，还有有时候心跳的不舒服。",  "en": "Sometimes a little dizzy, and sometimes uncomfortable heartbeat." } }
{ "translation": { "zh": "我的胸腔这边有个肿块，不太会痛，但是已经在这边有点久了，有一个月。",  "en": "There is a lump on this side of my chest, it doesn't hurt very much, but it has been here for a long time, for a month." } }
{ "translation": { "zh": "对的，好吧。请告诉我更多有关发生的事情。好的，好的。嗯，你提到你有点担心，呃，所以我们可以解决这个问题。呃，你有什么特别担心的吗？",  "en": "Right, okay. Just tell me a bit more about what’s been going on. Okay, alright. Um, well, you mentioned you’re a bit worried, uh, so we can address that. Uh, anything in particular you’re worried about?" } }
{ "translation": { "zh": "我爸爸最近骑车右脚擦伤，能帮我看一下吗？",  "en": "My dad recently bruised his right foot while riding a bike, can you take a look at it for me?" } }
{ "translation": { "zh": "好的，对。嗯，再次，我很遗憾听到这个消息。嗯，我只是想稍微向你保证，嗯，正如你所经历的那样，呼吸困难和咳嗽的原因有很多。对我们来说，最好的办法是了解完整的病史，呃，做适当的检查和调查，这会让我们更好地了解正在发生的事情。",  "en": "Okay, right. Uh, well, again, I’m sorry to hear that. Um, I do just want to reassure you slightly, um, there are many causes of breathlessness and coughs as you’ve been experiencing. The best thing for us to do is to take a full history, uh, do the appropriate examinations and investigations, and that’ll give us a much better idea as to what’s going on." } }
{ "translation": { "zh": "我这几天有足够的睡眠，但我的头一直很晕。",  "en": "I've had enough sleep these days, but my head has been dizzy." } }
{ "translation": { "zh": "保罗，我只想检查一下你的一些关键的身体系统，只是为了了解你的整体健康状况。嗯，你能告诉我，嗯，你有头痛吗？你，好吧——你多久头痛一次？",  "en": "I just want to go through some of your key, sort of, body systems, Paul, just to find out about your overall health. Um, can you tell me about, um, do you suffer with headaches at all? Do you, okay — how often do you get headaches?" } }
{ "translation": { "zh": "你是否服用任何消遣性药物，或任何非处方药？",  "en": "And do you take any recreational drugs, or any, any drugs that aren’t prescribed?" } }
{ "translation": { "zh": "好吧，我很遗憾听到这件事发生在你爸爸身上。嗯，你介意我问一下到底是什么情况吗？",  "en": "Mm’kay, well I’m sorry to hear that that happened to your dad. Um, do you mind me asking exactly what the situation was?" } }
{ "translation": { "zh": "我吃了退烧药，可是没有效果。",  "en": "I took antipyretics, but it didn't work." } }
{ "translation": { "zh": "查看您的胸部 X 光片，您似乎患有所谓的肺炎。你以前听说过这个吗？",  "en": "Looking at your chest x-ray, it seems that you have what's called a pneumonia. Have you ever heard of this before?" } }
{ "translation": { "zh": "我頸項有點痠痛 不管怎麼使勁按摩 都沒有好轉的跡象",  "en": "My neck is a little sore, no matter how hard I massage it, it doesn't seem to get better" } }
{ "translation": { "zh": "有没有什么姿势可以让你的呼吸更好？任何使情况变得更糟的职位？",  "en": "Are there any positions that make your breathing better? Any positions that make it worse?" } }
{ "translation": { "zh": "我这几天回到家都一直很累，但还是睡不着。",  "en": "I've been very tired these days when I get home, but I still can't sleep." } }
{ "translation": { "zh": "躺下和深呼吸时感觉更糟；当你身体前倾时会稍微好一点。",  "en": "It feels worse when you lie down, and when you take a deep breath; slightly better when you lean forwards." } }
{ "translation": { "zh": "好的，那你的骨头呢？关节有问题吗？",  "en": "Okay, and what about your bones? Any joint problems?" } }
{ "translation": { "zh": "你的痰里没有任何血，没有发烧，没有不明原因的体重减轻，呼吸还好……",  "en": "You’ve not had any blood in that phlegm, no fever, no unexplained weight loss, breathing’s okay, as well…" } }
{ "translation": { "zh": "我最近近视散光感觉加深了。",  "en": "My myopia and astigmatism have been getting worse recently." } }
{ "translation": { "zh": "好的。你有服用任何常规药物吗？",  "en": "Good. Do you take any regular medications?" } }
{ "translation": { "zh": "没有口腔溃疡之类的？",  "en": "No mouth ulcers or anything like that?" } }
{ "translation": { "zh": "当我们查看您的实验室时，我们发现您有点贫血，这意味着您血液中携带氧气的细胞无法正常运作。这可以解释为什么您一直感到呼吸急促。",  "en": "When we looked at your labs, we saw that you're a bit anemic, meaning that the cells in your blood that carry oxygen aren't functioning the way they should. This may explain why you've been feeling short of breath." } }
{ "translation": { "zh": "脖子淋巴肿痛，摸着有一个大大的包块，休息睡眠不好",  "en": "The neck lymph nodes are swollen and painful, and there is a big lump when I touch it, and I can't sleep well" } }
{ "translation": { "zh": "除此之外，我也会有一直想吐的感觉。",  "en": "In addition to that, I would also have a constant feeling of wanting to throw up." } }
{ "translation": { "zh": "我以一天會坐在電腦桌前至少12個小時 然後坐姿不良 現在脊椎不太對勁 有點不舒服",  "en": "I used to sit at a computer desk for at least 12 hours a day and then I had bad posture and now my spine is not right and I feel a little uncomfortable" } }
{ "translation": { "zh": "走路还可以走，可是没有那么顺畅和便利。",  "en": "Walking is still possible, but not so smooth and convenient." } }
{ "translation": { "zh": "你，呃，和你女朋友住在一起，你很幸福；工作很好，嗯，你真的只是想让我们解决你的喉咙痛和咳嗽问题。",  "en": "You, uh, live with your girlfriend, and you’re quite happy; work is good, um, and you really just want us to sort out your sore throat and cough." } }
{ "translation": { "zh": "我身体有点不舒服，可能是因为昨天晚上没有睡足。",  "en": "I'm a little unwell, probably because I didn't get enough sleep last night." } }
{ "translation": { "zh": "所以在两三个星期之前真的没有问题。",  "en": "So before two or three weeks no problems really." } }
{ "translation": { "zh": "大夫，我是想咨询一下，孩子今天晚上睡前总是深呼吸，像喘不动气似的",  "en": "Doctor, I want to consult, the child always takes a deep breath before going to bed tonight, as if he can’t breathe" } }
{ "translation": { "zh": "你有任何其他健康状况吗？",  "en": "Do you have any other medical conditions?" } }
{ "translation": { "zh": "当你说你有麻木时，你是说什么都感觉不到还是手脚发麻？感觉脚是睡着了还是完全没有感觉？",  "en": "When you say you have numbness, are you talking about not being able to feel anything or does it feel like pins and needles in your hands and in your feet? Does it feel like your foot has fallen asleep or does it completely feel like there's no sensation there?" } }
{ "translation": { "zh": "最近用手指接收常常手指会觉得卡卡的，用起来很不顺。",  "en": "Recently, when using fingers to receive, the fingers often feel stuck, which is very uncomfortable to use." } }
{ "translation": { "zh": "是什么让咳嗽和喉咙痛更适合你？有什么缓解因素吗？",  "en": "What makes a cough and sore throat better for you? Is there any relieving factors?" } }
{ "translation": { "zh": "大家好，我是钟医生。我是在急诊室工作的医生之一。今天是什么让你进来了？",  "en": "Hi, my name is Dr. Chung. I'm one of the doctors working in the emergency department. What brings you in today?" } }
{ "translation": { "zh": "好吧，好吧……还有什么能让事情变得更糟的吗，咳嗽？什么都没有，好吧 - 你认为它是什么？",  "en": "Okay, okay… anything make it worse at all, this cough? Nothing at all, okay - what do you think it is?" } }
{ "translation": { "zh": "你能感觉到我在你脸的两侧触摸你吗？双侧感觉一样吗？你能感觉到我在你两侧膀臂触摸你吗？两边的感觉一样吗？你能感觉到我在触摸你的腿吗？感觉一样吗？你能感觉到我在触摸你吗？",  "en": "Can you feel me touching you on the sides of your face? Do both sides feel the same? Can you feel me touching you up here in your arms? Do they feel the same? Can you feel me touching you in the legs? Does it feel the same? Can you feel me touching you?" } }
{ "translation": { "zh": "这几天我一直想自杀，世界上一个朋友都没有。",  "en": "I've been thinking about suicide these days and I don't have a single friend in the world." } }
{ "translation": { "zh": "脚拇指又红又肿，很疼痛，穿不进鞋子，走路的时候也痛",  "en": "The thumb of the foot is red and swollen, it is very painful, I can't put on the shoes, and it hurts when I walk" } }
{ "translation": { "zh": "上个月也发炎了，看嗓子也有这个白色异物，之前也有，嗓子不舒服，第一次看到白色东西，到现在大概有大半年到一年了",  "en": "I also had an inflammation last month. I saw this white foreign object in my throat. I had it before. My throat was uncomfortable. It has been about half a year to a year now since I saw a white thing for the first time." } }
{ "translation": { "zh": "我觉得我昨天晚上好像有点恐慌症发作了。",  "en": "I feel like I had a bit of a panic attack last night." } }
{ "translation": { "zh": "我覺得我好像尿尿太頻繁了 一天會尿十幾次",  "en": "I feel like I'm peeing so much I pee a dozen times a day" } }
{ "translation": { "zh": "醫生我我的老公的手術做做得怎麼樣啊",  "en": "Doctor, how is my husband's surgery going?" } }
{ "translation": { "zh": "我现在只想问你更具体的问题。你说痰里没有血，嗯，但是，有没有发烧，有没有发抖的感觉？",  "en": "I just want to ask you more specific questions now. You said there’s no blood in the phlegm, um, but, is there any fever, any feeling shivery?" } }
{ "translation": { "zh": "看网上说可能轻微脑震荡 可以不用去医院 自己注意休息",  "en": "I read online that it might be a slight concussion, so I don’t need to go to the hospital, just need to get more rest." } }
{ "translation": { "zh": "我在走路的时候我都觉得我身上的肥肉很多，我很不喜欢照镜子，我也不喜欢我的身形。",  "en": "When I walk, I feel that I have a lot of fat on my body. I don't like looking in the mirror very much, and I don't like my body shape." } }
{ "translation": { "zh": "舅舅最近被诊断出胃溃疡，医生会建议要吃什么呢？",  "en": "My uncle was recently diagnosed with a stomach ulcer. What would the doctor suggest to eat?" } }
{ "translation": { "zh": "我这几天有点便秘，无论我每天吃多少，每次上厕所都没啥出来。",  "en": "I have been a little constipated these days, no matter how much I eat every day, nothing comes out every time I go to the toilet." } }
{ "translation": { "zh": "好的，很高兴听到这个消息。嗯，在过去的一周里，你怎么说它发生了变化？",  "en": "Okay, that’s good to hear. Um, and over the last week, how would you say it’s changed at all?" } }
{ "translation": { "zh": "我从上个礼拜开始一直拉肚子，昨天要换裤子，换了3次。",  "en": "I have been having diarrhea since last week. I had to change my pants yesterday, and I changed them 3 times." } }
{ "translation": { "zh": "你高兴我们继续吗？好的。那么，是什么让你今天进来的，阿纳斯？",  "en": "You happy for us to proceed? Okay. So what’s brought you in today, Anas?" } }
{ "translation": { "zh": "昨天我在图书馆的时候，我突然觉得好像有什么东西压着，让我喘不过气来。",  "en": "While I was in the library yesterday, I suddenly felt as if something was pressing down on me and I couldn't breathe." } }
{ "translation": { "zh": "Em，好吧，让我们回到呼吸困难的话题。嗯……这对不同的人可能意味着不同的事情。当你说呼吸困难时，你能准确解释你的意思吗？",  "en": "Em, well, let’s just go back to the breathlessness. Um… that could mean different things to different people. Can you explain exactly what you mean when you say breathlessness?" } }
{ "translation": { "zh": "就在前几天我的腰上有长出小小的痘痘。没有疼痛但是很痒。有什么药膏可以涂吗？",  "en": "Just the other day I had small pimples on my waist. No pain but itching. Is there any ointment to apply?" } }
{ "translation": { "zh": "他现在在做脑康复的运动训练，可以练爬，练站吗？双腿可不可以用力，能不能去游泳，",  "en": "He is doing brain rehabilitation exercise training now, can he practice climbing and standing? Can you use your legs hard, can you go swimming," } }
{ "translation": { "zh": "每天药都按时喷，按时吃，几乎没有效果。我儿子就是前半夜打呼噜，中午不打，晚上不憋气，也不张嘴，您看用手术吗",  "en": "The medicine is sprayed and taken on time every day, but it has almost no effect. My son snores in the first half of the night, but does not snore at noon, and does not hold his breath or open his mouth at night. Would you like to use surgery?" } }
{ "translation": { "zh": "听上去怎么样？除此之外，你今天还有什么期待得到的吗？",  "en": "How does that sound? Besides that, anything else you were expecting to get out of today?" } }
{ "translation": { "zh": "好吧，嗯，你咳出的痰是什么颜色的？是……量很大，还是？难道……里面有血？",  "en": "Right, okay, um, what color is the muck that you’re coughing up? Is it… it is large amounts, or? Is it… is there any blood in it?" } }
{ "translation": { "zh": "你在吃什么，为什么停了？",  "en": "What were you taking and why did you stop?" } }
{ "translation": { "zh": "有时候我看手机看太久 眼睛有点干涩的感觉",  "en": "Sometimes my eyes feel a little dry when I look at my phone for too long" } }
{ "translation": { "zh": "我昨天好像吃到了没有煮熟的猪肉，因为肉里面有血腥的味道",  "en": "I seem to have eaten undercooked pork yesterday because the meat smelled like blood" } }
{ "translation": { "zh": "你现在在工作吗？你觉得能够带着你的症状去工作吗？",  "en": "Are you working at the moment? Do you feel able to go to work with your, symptoms?" } }
{ "translation": { "zh": "对……还有喉咙痛。它发生的时间是否相同？",  "en": "Right…and a sore throat. Has it been there the same amount of time?" } }
{ "translation": { "zh": "我觉得头中间渐渐地有疼痛。吃了泰诺也没有用。这个症状持续有半年了。",  "en": "I felt a gradual pain in the middle of my head. Tylenol didn't help either. This symptom has been going on for half a year." } }
{ "translation": { "zh": "好的，你感到呼吸困难吗？或者你有任何呼吸问题或胸闷吗？",  "en": "Okay, and what about breathlessness? Are you-any breathing problem, or chest tightness?" } }
{ "translation": { "zh": "我昨天从脚踏车摔车，脖子现在很痛。",  "en": "I fell from my bike yesterday and my neck is sore now." } }
{ "translation": { "zh": "好的。家族中是否还有其他医疗问题？",  "en": "Okay. And are there any other medical problems that run in the family?" } }
{ "translation": { "zh": "而且，正如我们之前提到的，你知道，最好的事情就是，呃，我们现在正在做的事情，而你今天的到来已经做了最好的事情。",  "en": "And, as we mentioned before, the, you know, the best thing to do is, uh, what we’re doing right now, and you’ve done the best thing by coming in today." } }
{ "translation": { "zh": "如果可以的话，我只想问你几个关于你自己的问题。",  "en": "I’m just gonna ask you a few more questions about yourself, if that’s okay." } }
{ "translation": { "zh": "你知道你家里有人得了癌症吗？",  "en": "Does anybody in your family have cancer that you know of?" } }
{ "translation": { "zh": "你还有别的问题吗？咨询到此结束；谢谢你今天跟我说话。",  "en": "Do you have any other questions? That’s the end of the consultation; thanks for talking to me today." } }
{ "translation": { "zh": "我昨天跟我床伴在床上玩，现在有根黄瓜卡在我屁股里出不来。",  "en": "I was playing in bed with my partner yesterday and now I have a cucumber stuck in my ass." } }
{ "translation": { "zh": "你举过重物吗？",  "en": "Have you lifted anything heavy?" } }
{ "translation": { "zh": "我发觉胸口间接性的疼痛。持续了1，3分钟之后就自己慢慢的好了。但是这个症状我有点担心。",  "en": "I felt an inconstant pain in my chest. It lasted for 1 to 3 minutes and then slowly faded away. But I'm a little worried about this symptom." } }
{ "translation": { "zh": "从那以后你有没有服用任何消遣性药物？",  "en": "Have you taken any recreational drugs since then?" } }
{ "translation": { "zh": "你肚子痛吗？",  "en": "And do you have any tummy pain at all?" } }
{ "translation": { "zh": "上礼拜我跟男生上床 ，但是我们没有戴套，但现在我都在阴蒂附近发现有臭臭白色不明的液体。",  "en": "I slept with a guy last week, but we didn't wear a condom, but now I have found a smelly white unidentified fluid near the clitoris." } }
{ "translation": { "zh": "你能告诉我更多关于你腹痛的事吗？你能指出最痛的地方吗？您是否因这种腹痛而感到恶心或呕吐？您最后一次排便是什么时候，您的大便是什么颜色的？大便时有没有带血？",  "en": "Can you tell me a little bit more about your abdominal pain? Can you point to where it hurts the most? Are you having any nausea or vomiting with this abdominal pain? When was the last time you had a bowel movement and what color was your bowel? Was there any blood with your bowel movement?" } }
{ "translation": { "zh": "你有癫痫发作的家族史吗？",  "en": "Do you have a family history of seizures?" } }
{ "translation": { "zh": "你可以检查一下吗？你里面有血吗？",  "en": "Can you check? Do you have any blood in it at all?" } }
{ "translation": { "zh": "被鱼刺卡住了喉咙，吐不出来",  "en": "Throat stuck by fishbone, unable to spit out" } }
{ "translation": { "zh": "你是独居的吗？",  "en": "Do you live by yourself?" } }
{ "translation": { "zh": "这几天我觉得睡眠状态很差，一直在床上反反复复的睡不着。可能是工作的压力吧但是都是睡不着的。然后白天很疲惫。",  "en": "In the past few days, I feel that my sleep quality is very poor, I roll back and forth in bed but I can't fall asleep. Maybe it's the pressure of work, but I can't sleep. And then I got very tired during the day." } }
{ "translation": { "zh": "最近肚子常常胀气，很不舒服。",  "en": "Recently, my stomach is often bloated and very uncomfortable." } }
{ "translation": { "zh": "还有你的饮食，你吃得好吗？你锻炼吗？我想如果你能找到那个时间它会放松，我想，帮助，你知道，对你的糖尿病也有好处。",  "en": "And your diet, you eat well? And do you exercise? I suppose if you could find that time it’ll be relaxing, I suppose, to help, you know, good for your diabetes as well." } }
{ "translation": { "zh": "这几天头痛，天旋地转，不能起床。",  "en": "These days, I have a headache and very bad dizziness , and I can't get up." } }
{ "translation": { "zh": "我認為我的阿嬤開始有點癡呆 她覺得我還是四歲的小孩",  "en": "I think my grandma is starting to get a little bit dementia. She thinks I'm a four year old" } }
{ "translation": { "zh": "好吧，而且 - 咳嗽对你来说有多严重，不超过 10 分？ 10 是最差的。",  "en": "Okay, and — how bad, on a scale of not to 10 is that cough for you? 10 being the worst possible." } }
{ "translation": { "zh": "撞到那两天会恶心 想呕 没有呕 之后没有出现这种情况了",  "en": "I felt nauseous and wanted to vomit for two days when I hit it. After that I no longer feel the nausea." } }
{ "translation": { "zh": "以及家庭中的任何癌症，或者，你已经 - 好吧，好吧，太棒了！",  "en": "And any cancers in the family or, you’ve been — okay good, okay, brilliant!" } }
{ "translation": { "zh": "我只想总结一下，保罗，如果你不介意的话，嗯，如果我有任何错误，请纠正我。",  "en": "I just want to sum up, Paul, if you don’t mind; um, please correct me if I’ve got any of it wrong." } }
{ "translation": { "zh": "我的左下腿突然发肿发热而且疼痛感非常的疼。这个症状让我很担心。",  "en": "My lower left leg suddenly became swollen, hot and very painful. This symptom worries me." } }
{ "translation": { "zh": "那么，您是否有任何头痛、痉挛、晕厥、昏厥等类似情况？",  "en": "So do you get any headaches, fits, faints, blackouts, anything like that?" } }
{ "translation": { "zh": "好的，在我们继续之前，您还有什么要补充的吗？",  "en": "Okay, is there anything else you want to add to that, before we move on?" } }
{ "translation": { "zh": "那么从 1 到 10 的等级，1 代表没有痛苦，10 代表你生命中最痛苦的，你认为你的痛苦有多严重？",  "en": "So on a scale from 1 to 10, 1 being no pain and 10 being the worst pain of your life, how bad would you say your pain is?" } }
{ "translation": { "zh": "这一切是从什么时候开始的？当一切开始时你在做什么？",  "en": "When did this all start? And what were you doing when it all started?" } }
{ "translation": { "zh": "你能不能帮我开止痛药？",  "en": "Can you prescribe pain medication for me?" } }
{ "translation": { "zh": "我发了二天高烧，咳嗽，喉咙痛，无法正常吞咽食物",  "en": "I had a high fever for two days, cough, sore throat, unable to swallow food normally" } }
{ "translation": { "zh": "还有，你最近有没有出国旅行过？很遗憾听到这个消息。",  "en": "And, have you traveled abroad anywhere recently? Sorry to hear that." } }
{ "translation": { "zh": "睡觉的时候明显感觉发烧的症状，身体发热发冷还有出一点冷汗但是没有查体温就是觉得体温上生。",  "en": "When sleeping, I obviously felt the symptoms of fever. My body is hot and cold, and there is a little cold sweat, I didn’t check the temperature but I feel that the temperature is rising." } }
{ "translation": { "zh": "一点点关于你的，嗯，手术，过去，你做过手术吗？",  "en": "A little bit about your, um, surgical, in the past, have you ever had any operations?" } }
{ "translation": { "zh": "嗯，所以，在过去的几周或几个月里，嗯，你注意到体重减轻了吗？",  "en": "Um, so, in the last few weeks or months, um, have you noticed any weight loss?" } }
{ "translation": { "zh": "以前很小的时候有开过刀。基本上从青少年到现在都没有。",  "en": "I had surgery when I was very young. Basically nothing from teens to now." } }
{ "translation": { "zh": "我昨天煮菜的时候，刀掉到我的脚上，流了很多血。",  "en": "When I was cooking yesterday, the knife fell on my foot and it bled a lot." } }
{ "translation": { "zh": "最近看电脑一整天下来眼压很重。",  "en": "I've been staring at the computer all day lately and my eye pressure is very heavy." } }
{ "translation": { "zh": "我上个月去验乳癌，结果呈现阳性。",  "en": "I went for a breast cancer test last month and it came back positive." } }
{ "translation": { "zh": "5年前了，上传的片子是去年11月拍的CT！",  "en": "It was 5 years ago, and the uploaded film was a CT shot in November last year!" } }
{ "translation": { "zh": "我可以问你，你抽烟吗？你……好吧。嗯，我能问一下你抽什么烟吗？你一天吸多少支香烟？是……好吧。还有，你是几岁开始吸烟的？",  "en": "Can I ask you, do you smoke at all? Do you…okay. Um, can I ask what you smoke? And how many cigarettes do you go through in a day? Is it…okay. And, at what age did you start smoking?" } }
{ "translation": { "zh": "我的左手臂晚上的时候突然麻痹，动不了然后过了10分钟慢慢恢复了。但是突然之间麻痹让我很担心。",  "en": "My left arm was suddenly paralyzed at night, I couldn't move it and then it was slowly recovered after 10 minutes. But the sudden numbness worries me." } }
{ "translation": { "zh": "您是否曾被告知您患有肺病或心脏病？",  "en": "Have you ever been told you have lung or heart disease?" } }
{ "translation": { "zh": "我今天上午把脚崴了，很痛，完全不能走路，担心是不是骨折了。",  "en": "I sprained my ankle this morning. It hurts so much that I can't walk at all. I'm worried about whether the bone is broken." } }
{ "translation": { "zh": "我知道现在真的很混乱，但我叫埃里克。我是创伤小组的医生之一。很多事情会同时发生。我们要把你所有的衣服都脱掉，看看你身上有没有受伤，然后按一下地方，看看有没有痛。如果你有任何疼痛，当我按下它时你能告诉我吗？现在有什么事情困扰你吗？你能告诉我你是否有任何胸痛或呼吸急促吗？",  "en": "I know it's really chaotic right now, but my name is Eric. I'm one of the doctors working on the trauma team. A lot of things are gonna happen all at once. We're going to take off all your clothes to see if there's any injuries on your body and we're going to press on places to see if there's any pain. If you have any pain, can you please tell me when I press on it? Is there anything bothering you right now? Can you tell me if you're having any chest pain or shortness of breath?" } }
{ "translation": { "zh": "我儿子大概十八岁的时候开始发育。",  "en": "My son started puberty when he was about eighteen." } }
{ "translation": { "zh": "而且，当你感到疼痛时，你是否会同时出现任何症状，如呼吸困难、心悸、出汗？",  "en": "And, when you get the pain, do you get any of the symptoms at the same time, like breathlessness, palpitations, you feel sweaty?" } }
{ "translation": { "zh": "我跟朋友聊天时，有点听不到他们到底在说啥。",  "en": "When I'm chatting with my friends, I can't hear what they're saying." } }
{ "translation": { "zh": "好吧，你已经告诉我很多关于你肚子的事了。那么有任何肌肉酸痛吗？",  "en": "Okay, you've told me quite a bit about your tummy. So any muscle aches and pains at all?" } }
{ "translation": { "zh": "我爷爷大概二十岁就开始喝酒，最近他每次喝酒的时候都觉得胃在烧。",  "en": "My grandpa started drinking when he was about 20 years old, and recently every time he drinks, he feels his stomach burns." } }
{ "translation": { "zh": "我这几天一直流鼻涕，可能是因为天气突然变冷了。",  "en": "I've been having a runny nose for the past few days, probably because of the sudden cold weather." } }
{ "translation": { "zh": "而且，当疼痛来临时，它会持续多长时间？",  "en": "And, when the pain comes on, how long does it last for?" } }
{ "translation": { "zh": "你能不能用你的手指触摸我的手指，然后在用你的手指触摸我的手指后，你能不能触摸你的鼻子，并在我移动手指时继续重复这个动作。你能不能用你的脚后跟沿着你另一条腿的胫骨向下移动，你也可以用你的另一条腿做同样的事情吗？",  "en": "Can you take your finger and touch my finger and then after you touch my finger with your finger can you touch your nose and continue to repeat this as I move my finger. Could you take your heel of your foot and run it down the shin of your other leg and could you also do that with your other leg." } }
{ "translation": { "zh": "一旦站起来就会有一种想要昏倒的感觉。",  "en": "Feeling like passing out as soon as I stand up." } }
{ "translation": { "zh": "这种痛是这样子. 走路的时候，走快一点，会突然感觉气喘不过来，胸部会有压迫性的感觉的痛。",  "en": "This kind of pain is like this. When walking, walk faster, you will suddenly feel out of breath, and there will be oppressive pain in the chest." } }
{ "translation": { "zh": "是……喉咙痛的时候你能吞咽吗？你可以，你可以喝，好吧。还有，咳嗽，你能为我描述一下吗？",  "en": "Is it… Are you able to swallow with that sore throat? You can, you can drink, okay. And, the cough, can you describe it for me?" } }
{ "translation": { "zh": "你有胸痛吗？恶心？你觉得出汗吗？",  "en": "Do you have any chest pain? Nausea? Do you feel sweaty at all?" } }
{ "translation": { "zh": "我昨晚被狗咬了 傷口看起來蠻淺的 但現在蠻痛的",  "en": "I was bitten by a dog last night and the wound looked shallow but it hurts now" } }
{ "translation": { "zh": "那么当你躺下时情况会更糟吗？而且，在 1 到 10 的范围内，如果 10 是您能想象的最严重的疼痛而 1 根本没有疼痛，您认为疼痛有多严重？",  "en": "So is it worse when you were lying down? And, on a scale of 1 to 10, how bad would you say the pain is if 10’s the worst pain you can imagine and 1’s no pain at all?" } }
{ "translation": { "zh": "好的，它会传播到其他任何地方吗，这种喉咙痛，任何形式的疼痛辐射？",  "en": "Okay, does it travel anywhere else, this sore throat, any sort of, radiation of pain?" } }
{ "translation": { "zh": "很疼，就惊呆了，头脑一片空白。",  "en": "It hurt so much that I was stunned and my mind went blank." } }
{ "translation": { "zh": "背上长了一个大水泡，非常疼痛，不能躺平",  "en": "Had a big blister on my back that was so painful I couldn't lie flat" } }
{ "translation": { "zh": "我昨天过敏反应非常严重，喉咙感觉快呼吸不到气了。",  "en": "I had a very severe allergic reaction yesterday, and my throat feels like I can't breathe." } }
{ "translation": { "zh": "这几天便秘得比较严重。",  "en": "Constipation has been severe for the past few days." } }
{ "translation": { "zh": "我昨天搭公车时，坐在我前面的人一直咳嗽。今天，我喉咙有点不舒服。",  "en": "When I took the bus yesterday, the person sitting in front of me kept coughing. Today, my throat is a little uncomfortable." } }
{ "translation": { "zh": "您曾经做过内窥镜检查来评估您的溃疡吗？你做过结肠镜检查吗？如果是，您最后一次进行结肠镜检查是什么时候？他们发现了什么？",  "en": "Have you ever had an endoscopy done to evaluate your ulcers? Have you ever had a colonoscopy? And if so, when was the last time you had a colonoscopy? And what did they find?" } }
{ "translation": { "zh": "我的脚掌最近长出了一些水疱，抓起来会很痒。",  "en": "I've recently developed some blisters on the soles of my feet that are very itchy to scratch." } }
{ "translation": { "zh": "还有，结核病呢？任何患有结核病的人，或者你曾经患过结核病，都必须——？",  "en": "And, what about TB? Anybody with TB, or you’ve been, had to—?" } }
{ "translation": { "zh": "我运动的时候常常会非常的喘。",  "en": "I often get very out of breath when I exercise." } }
{ "translation": { "zh": "当你平躺时，你有没有呼吸困难？好吧，你说你晚上睡觉用多少个枕头？",  "en": "Do you ever have trouble breathing when you're lying flat? Well, how many pillows would you say that you use to sleep at night?" } }
{ "translation": { "zh": "小时候听说助色的青霉素皮是有过敏，但是现在好像用口服的青霉素也没有什么反应。",  "en": "When I was a child, I heard that I was allergic to the penicillin skin that helped color, but now it seems that there is no reaction to oral penicillin." } }
{ "translation": { "zh": "我在这里看到你在 6 月癫痫发作，他们将你的 Keppra 增加到 1 克，每天两次。",  "en": "I see here that you had a seizure in June and they increased your Keppra to 1 gram 2 times a day." } }
{ "translation": { "zh": "好吧，好吧，你有没有心脏病发作，或者，你的家人？",  "en": "Good, okay, have you ever had a heart attack, or, any member of your family?" } }
{ "translation": { "zh": "后腰下部感觉像针刺一样的疼痛，无法座下来",  "en": "Needle-like pain in the lower back, unable to sit down" } }
{ "translation": { "zh": "有时我在晚上的时候我就莫名其妙地开始哭，但是我不能控制，然后，有时候会用到20分钟才会好一点，然后才会比较静下来。",  "en": "Sometimes I start crying for no reason at night, but I can't control it, and then, sometimes it takes 20 minutes to get better, and then it will calm down." } }
{ "translation": { "zh": "我常常咬指甲，所以现在手指头容易流血。",  "en": "I often bite my nails, so now my fingers bleed easily." } }
{ "translation": { "zh": "我不知道为什么这几天我的脸上又长出来很多青春痘。",  "en": "I don't know why these days I have so many pimples on my face again." } }
{ "translation": { "zh": "吃了莫一些东西之后，觉得腹部剧疼。一直有恶心，呕吐，还有拉肚子。拉肚子有三四次了。",  "en": "After eating something, I felt a sharp pain in my abdomen. I felt nausea all the time, I vomitted and had diarrhea. I had diarrhea three or four times." } }
{ "translation": { "zh": "你有癫痫发作吗？",  "en": "Have you had seizures?" } }
{ "translation": { "zh": "睡眠不太好，心里有事的话就会失眠。比索洛尔吃完后有缓解，心跳没有原来那么快了。",  "en": "I don't sleep well, and if I have something on my mind, I will suffer from insomnia. After taking bisoprolol, there was relief, and the heartbeat was not as fast as before." } }
{ "translation": { "zh": "你最近流鼻涕和喉咙痛。那个听起来是对的吗？",  "en": "You’ve had a sniffle and a sore throat recently. Does that sound about right?" } }
{ "translation": { "zh": "我只想问一下你的饮酒量；你喝酒吗？呃，你平时喝什么？你喝多少酒？",  "en": "I just want to ask about your alcohol intake; do you drink? Uh, what do you normally drink? And how much wine do you drink?" } }
{ "translation": { "zh": "我觉得我最近连续四天都鬼压着。",  "en": "I feel like I've been haunted for four days in a row." } }
{ "translation": { "zh": "我在路边的时候，突然有一辆车，他是往后倒车，突然就撞到我的右大腿上。",  "en": "When I was on the side of the road, suddenly there was a car, he was backing up, and suddenly hit my right thigh." } }
{ "translation": { "zh": "我有時候咳嗽或笑得太用力 我都會尿一點出來",  "en": "I sometimes cough or laugh so hard I pee a little" } }
{ "translation": { "zh": "好吧，你知道吗，嗯，二甲双胍，你服用了吗 - 你服用剂量吗？多久服用一次？哦，好的，我们可以检查一下。我们可以跟进，好的。",  "en": "Okay, and do you know, um, the metformin, do you take it — do you do it in a dosage, and how often? Oh okay, we can check that out. We can follow that up, okay." } }
{ "translation": { "zh": "我昨天在後院铲雪的時候好像閃到腰了 現在痛到沒辦法躺下來",  "en": "I was shoveling snow in the back yard yesterday and I might have hurt my back, it hurts so much I can't lie down now" } }
{ "translation": { "zh": "胃肠功能紊乱，但是我吃饭正常呀，体型偏胖",  "en": "Gastrointestinal dysfunction, but I eat normally, and I am overweight" } }
{ "translation": { "zh": "你希望我今天能做些什么吗？",  "en": "Was there anything that you were hoping I could do today?" } }
{ "translation": { "zh": "所以，我现在问了你很多问题。而且，我只是想从你自己身上找出，嗯，你认为有什么事情可能会发生吗？",  "en": "So, I’ve asked you quite a few questions now. And, I just want to find out from yourself, um, is there anything that you think might be going on?" } }
{ "translation": { "zh": "早上我在跑步的時候好像被一隻蟲咬了大腿 現在已經開始腫脹 然后越來越疼",  "en": "I felt like I got bitten by a bug while I was running in the morning and my thigh is now starting to swell and hurt more and more" } }
{ "translation": { "zh": "没有压力？太棒了，好吧。你住在房子里还是公寓里？这是一个两居室的房子，你是房主吗？你有自己的房子，很好。好的！",  "en": "No stresses? Excellent, okay. And do you live in a house or a flat, or? It’s a two bedroom house, are you a house owner are you? You own your own house, excellent. Good!" } }
{ "translation": { "zh": "在吃完生鱼片之后我有点胃绞痛，这正常吗。",  "en": "I have a bit of stomach cramps after eating sashimi, is this normal." } }
{ "translation": { "zh": "玻璃窗打碎了，碎片扎进手臂，一直流血",  "en": "The glass window shattered, the shards went into the arm, and it kept bleeding" } }
{ "translation": { "zh": "我今天有点感冒，可能是因为昨天淋到雨了。",  "en": "I have a bit of a cold today, probably because I got rained on yesterday." } }
{ "translation": { "zh": "你有没有在半夜醒来时感到呼吸急促？",  "en": "Do you ever wake up in the middle of the night feeling short of breath?" } }
{ "translation": { "zh": "我昨天在踢足球，我现在左脚小腿肚有点酸，然后有点刺刺地痛，刺痛的感觉。",  "en": "I was playing football yesterday, and now my left calf is a little sore, and then it hurts a little bit, a tingling feeling." } }
{ "translation": { "zh": "还有，你的心情如何？你自己感觉如何？",  "en": "And, how’s your mood? How do you feel in yourself?" } }
{ "translation": { "zh": "你注意到还有什么让情况变得更糟的吗？好吧，尤其是平躺会让情况变得更糟吗？",  "en": "Anything else that you notice that makes it worse? Okay, in particular, does lying flat make it worse?" } }
{ "translation": { "zh": "最近晚上睡眠质量不良，有什么建议吗？",  "en": "I haven't had a good night's sleep lately, any suggestions?" } }
{ "translation": { "zh": "這兒-這兒是我不小心切到自己",  "en": "here - here is where i accidentally cut myself" } }
{ "translation": { "zh": "刚开始是持续性的，后来好像有疼痛有减轻一点。",  "en": "It was constant at first, but then seemed to have less pain." } }
{ "translation": { "zh": "你昨晚下班后开始感到轻微的、中央的、轻微的左侧胸痛。",  "en": "You’ve got a slight, central, slightly left-sided chest pain which started last night after work." } }
{ "translation": { "zh": "这个症状已经出现两三个月了。",  "en": "This symptom has been present for two or three months." } }
{ "translation": { "zh": "最近有点担心因为我觉得眼睛附近有一点黑黑的点点。我不知道什么原因但是一直出现在我的视线范围. 覺得點點那個黑色點點一直在我的視線",  "en": "I've been a little worried lately because I feel a little dark spots around my eyes. I don't know why but it keeps appearing in my sight. I feel like that black dot is always in my sight" } }
{ "translation": { "zh": "突然小腹剧烈疼痛，感觉冷，发抖，一直出冷汗",  "en": "Sudden severe pain in the lower abdomen, feeling cold, shivering, and sweating all the time" } }
{ "translation": { "zh": "好的，有心脏问题吗？有高血压吗？哦，你有，好的。什么时候确诊的，保罗？它是……并且控制得很好吗？上次检查是什么时候？而且，一切都很棒？完美的。",  "en": "Okay, any heart problems? Any high blood pressure? Oh you have, okay. And when was that diagnosed, Paul? Was it…and is it well controlled? When was it last checked? And, everything was great? Perfect." } }
{ "translation": { "zh": "我这几天走路的时候，脚会有点麻的感觉。",  "en": "When I walk these days, my feet feel a little numb." } }
{ "translation": { "zh": "哦，对了，呃，你还记得吗？藏毛窦——好的，好的。从那以后一切都好吗？好的 - 没有其他操作。",  "en": "Oh, right, what uh, do you recall? Pilonidal sinus — okay, okay. And has it been alright since then? Okay - and no other operations." } }
{ "translation": { "zh": "加药后没有发作过吗？",  "en": "You have had no seizures after the medication increase?" } }
{ "translation": { "zh": "每次我要开车的时候我都大量出汗。",  "en": "I sweat profusely every time I have to drive." } }
{ "translation": { "zh": "晚上有呼吸困难吗？",  "en": "Any difficulty breathing at night?" } }
{ "translation": { "zh": "你有过去的病史吗？",  "en": "Do you have past medical conditions?" } }
{ "translation": { "zh": "今天打球从高处跌落，脚踝关节疼痛无法行走了",  "en": "I fell from a high place while playing today, my ankle hurts and I can't walk anymore" } }
{ "translation": { "zh": "媽媽打針痛不打",  "en": "Mom, injection hurts, I don't want it." } }
{ "translation": { "zh": "我已经发烧了三天三夜，全身都在发抖。",  "en": "I have had a fever for three days and three nights, and my whole body is shaking." } }
{ "translation": { "zh": "你有没有消化不良？",  "en": "Do you ever get indigestion?" } }
{ "translation": { "zh": "所以最后检查一下你的症状。所以你告诉我腹泻中有一点血。",  "en": "So just a final check on your symptoms. So you've told me there's a little bit of blood in the diarrhea." } }
{ "translation": { "zh": "我最近吃东西都没食欲。",  "en": "I have no appetite to eat recently." } }
{ "translation": { "zh": "今天是否有任何其他症状困扰您，包括呼吸急促、腹痛、恶心、呕吐、头晕、头晕、发烧、咳嗽或黑便？",  "en": "Are there any other symptoms that are bothering you today including shortness of breath, abdominal pain, nausea, vomiting, dizziness, lightheadedness, fevers, cough, or dark stools?" } }
{ "translation": { "zh": "你有没有看到里面有没有被消化完全的食物？",  "en": "And do you ever see any food that's not digested properly in it?" } }
{ "translation": { "zh": "好的，很高兴今天见到你，阿纳斯。今天，负责您护理的医生让我来和您谈谈是什么让您进来的。只想让您知道，我们讨论的所有内容都是完全保密的，并保留在医疗团队中。听起来还好吗？",  "en": "Okay, it’s very nice to meet you today, Anas. Today I’ve just been asked by the doctors in charge of your care to come and speak to you about what’s brought you in. Just want to let you know, everything we discuss is completely confidential and kept within the medical team. Does all that sound okay?" } }